import { useState } from "react";
import Footer from "../components/layout/Footer";
import RouteBar from "../components/nav/RouteBar";

interface Job {
    title: string;
    exp: string;
    requirements: string[];
    responsibilities: string[];
    is_open: boolean;
}

interface JobCon {
    image: string;
    title: string;
    content: string;
}

export default function Vacancy() {
    const [jobs] = useState<Job[]>([
        {
            title: "Должность",
            exp: "Опыт работы от 1 года",
            responsibilities: [
                "Организация и проведение шеф-монтажных работ промышленного оборудования.",
                "Выполнение пуско-наладочных работ, диагностика и оптимизация работы оборудования.",
                "Обеспечение соблюдения технических стандартов и норм на всех этапах монтажа.",
                "Взаимодействие с клиентами для решения технических вопросов и предоставления консультаций.",
                "Обучение персонала клиента работе с установленным оборудованием.",
            ],
            requirements: [
                "Высшее техническое образование (механика, автоматизация или смежные области).",
                "Опыт работы в шеф-монтажных или пуско-наладочных работах от 3 лет.",
                "Знание принципов работы промышленного оборудования, включая автоматизированные системы.",
                "Готовность к частым командировкам, включая международные проекты.",
                "Умение работать в команде и высокий уровень ответственности."
            ],
            is_open: false,
        },
        {
            title: "Должность",
            exp: "Опыт работы от 1 года",
            responsibilities: [
                "Организация и проведение шеф-монтажных работ промышленного оборудования.",
                "Выполнение пуско-наладочных работ, диагностика и оптимизация работы оборудования.",
                "Обеспечение соблюдения технических стандартов и норм на всех этапах монтажа.",
                "Взаимодействие с клиентами для решения технических вопросов и предоставления консультаций.",
                "Обучение персонала клиента работе с установленным оборудованием.",
            ],
            requirements: [
                "Высшее техническое образование (механика, автоматизация или смежные области).",
                "Опыт работы в шеф-монтажных или пуско-наладочных работах от 3 лет.",
                "Знание принципов работы промышленного оборудования, включая автоматизированные системы.",
                "Готовность к частым командировкам, включая международные проекты.",
                "Умение работать в команде и высокий уровень ответственности."
            ],
            is_open: false,
        }
    ]);
    const [jobCons] = useState<JobCon[]>([
        {
            title: "Уникальные проекты",
            content: "Работа в ТОО «Elke Company» – это возможность участвовать в реализации проектов мирового уровня. Мы предоставляем нашим сотрудникам шанс получить уникальный опыт и работать с передовыми технологиями.",
            image: "1.png",
        },
        {
            title: "Поддержка и развитие",
            content: "Мы ценим каждого члена команды и стремимся обеспечить условия для их профессионального роста. Обучающие программы, участие в международных проектах и развитие лидерских качеств – это лишь малая часть того, что мы предлагаем.",
            image: "2.png",
        },
        {
            title: "Стабильность и уверенность",
            content: "За более чем 20 лет работы мы доказали свою надежность как для клиентов, так и для сотрудников. Работа у нас – это уверенность в завтрашнем дне и возможность строить карьеру в устойчивой компании.",
            image: "3.png",
        }
    ]);

    return (
        <div>
            <div className="px-20 py-10">
                <RouteBar />
            </div>
            <div className="px-20">
                <div className="mt-10 text-4xl">Вакансии</div>
                <div className="mt-7 font-light text-xl">Работа в сфере индустриального производства – это не только вызов, но и возможность быть частью команды, которая создаёт решения завтрашнего дня. ТОО «Elke Company» — это компания, где каждый сотрудник играет важную роль в достижении общих целей и реализации амбициозных проектов по всему миру.</div>
                <div className="mt-20 font-light text-xl">Преимущества работы у нас</div>
                <div className="mt-5 grid grid-cols-3 gap-5">
                    {jobCons.map((con, index) => (
                        <div key={index} className="font-light w-full">
                            <img src={`/jobs/${con.image}`} className="w-full object-cover" />
                            <div className="text-[#0061AD] mt-5">{con.title}</div>
                            <div className="mt-2">{con.content}</div>
                        </div>
                    ))}
                </div>
            </div>
            <div className="mt-20 grid grid-cols-7 px-20">
                <div className="col-span-3">
                    <div className="text-4xl">Открытые вакансии</div>
                </div>
                <div className="col-span-4 flex flex-col gap-5">
                    {jobs.map((job, index) => (
                        <div key={index} className="p-5 border border-[#f0f0f0]">
                            <div className="gap-5 flex justify-between">
                                <div>{job.title}</div>
                                <div>{job.exp}</div>
                                <div>-</div>
                            </div>
                        </div>
                    ))}
                </div>
            </div>
            <Footer />
        </div>
    )
}
